FKDD_COPY_DIFF_3_2026-02-13/Documents/ЗаменаВЗаказеПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаменаВЗаказеПоставщику</Name>
			<Comment>Замена в заказе поставщику</Comment>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыРаспределение</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Юридическое лицо, от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>Валюта документа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Comment>Курс валюты документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>Сумма документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВалютыУпр</Name>
					<Comment>Курс валюты управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен покупки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Comment>Сотрудник, заключивший сделку с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Контрагент, чей заказ корректируем</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Карточка</Name>
					<Comment>Карточка покупателя, по которой заказали товар</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Comment>Вид оплаты заказа покупателя</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата создания</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОперации</Name>
					<Comment>Дата операции</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Замены</Name>
					<Comment>Заменяемые товары</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Comment>Идентификатор строки</Comment>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар,услуга и т.п.)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТоварыЗаменители</Name>
					<Comment>Таблица заменителей заказанных товаров</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Comment>Идентификатор строки</Comment>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>Номенклатура (товар, услуга и т.п.)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма всегда без скидки. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>Ставка НДС по номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>Сумма НДС по номенклатурной позиции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>Характеристика/серия номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВсего</Name>
							<Comment>Итоговая сумма по строке документа со всеми налогами</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РаспределениеЗаказа</Name>
					<Comment>Таблица распределения заказа поставщика на заказы покупателей</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Comment>Идентификатор строки</Comment>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПокупателя</Name>
							<Comment>Заказ покупателя или внутренний заказ, под который осуществляется заказ данной номенклатуры</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказВнутренний</v8:Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>Количество единиц измерения номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>Единица измерения номенклатурной позиции</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>Коэффициент пересчета по отношению к базовой единице номенклатуры</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаказПоставщику</Name>
							<Comment>Заказ поставщику</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/РежимыАвтоСписанияХарактеристик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>РежимыАвтоСписанияХарактеристик</Name>
			<Comment>Режимы автоматического списания характеристик</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РучноеСписание</Name>
					<Comment>Выбор характеристики вручную в документах списания</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаИзготовленияВозр</Name>
					<Comment>Автоматическое списание в порядке возрастания дат изготовления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаИзготовленияУбыв</Name>
					<Comment>Автоматическое списание в порядке убывания дат изготовления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокГодностиВозр</Name>
					<Comment>Автоматическое списание в порядке возрастания сроков годности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокГодностиУбыв</Name>
					<Comment>Автоматическое списание в порядке убывания сроков годности</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СерийныйНомерВозр</Name>
					<Comment>Автоматическое списание в порядке возрастания серийных номеров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СерийныйНомерУбыв</Name>
					<Comment>Автоматическое списание в порядке убывания серийных номеров</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоВозр</Name>
					<Comment>Автоматическое списание в порядке возрастания категории качества</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоУбыв</Name>
					<Comment>Автоматическое списание в порядке убывания категории качества</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПорядокПартий</Name>
					<Comment>Характеристики не сортируются, все списывается в порядке списания партий</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Documents/ЗаменаВЗаказеПоставщику/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;				// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем РезультатОбработки Экспорт;	// Переменная для накопления результатов проведения по модулям наборов записей
Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/артикула в ТЧ
Перем ОбработкаЗначенияСвойствОбъектов Экспорт; // Переменная для хранения значения свойств основания/объекта копирования


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает соответствие в котором перечислены виды номенклатуры, которые нельзя вводить
// в таблицу товаров. Если таких нет, то возвращает неопределено
//
// Возвращаемое значение:
//  Результат - соответствие.
//
Функция ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры() Экспорт
	Результат=Новый Соответствие();
	Результат.Вставить(Перечисления.ВидыНоменклатуры.Услуга,0);
	Возврат Результат;
КонецФункции // ПолучитьСоответствиеЗапрещенныхВидовНоменклатуры()

// Возвращает структуру обязательных / уникальных реквизитов документа
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный
Функция ПолучитьОбязательныеРеквизиты() Экспорт
	
	// Обязательные поля таблицы товаров
	ОбязательныеТовары=Новый Структура();
	ОбязательныеТовары.Вставить("Номенклатура",3);
	//ОбязательныеТовары.Вставить("Количество",1);
	ОбязательныеТовары.Вставить("ЕдиницаИзмерения",3);
	ОбязательныеТовары.Вставить("Коэффициент",1);
	ОбязательныеТовары.Вставить("ХарактеристикаНоменклатуры",2);
	
	// Обязательные поля таблицы товаров
	ОбязательныеТовары = Новый Структура();
	ОбязательныеТовары.Вставить("Номенклатура",3);
	ОбязательныеТовары.Вставить("Количество",1);
	ОбязательныеТовары.Вставить("ЕдиницаИзмерения",3);
	ОбязательныеТовары.Вставить("Коэффициент",1);
	ОбязательныеТовары.Вставить("ХарактеристикаНоменклатуры",2);

	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Организация",1);
	ОбязательныеРеквизиты.Вставить("ДокументОснование",1);
	ОбязательныеРеквизиты.Вставить("ПодразделениеКомпании",1);
	ОбязательныеРеквизиты.Вставить("Автор",1);
	ОбязательныеРеквизиты.Вставить("ВалютаДокумента",1);
	ОбязательныеРеквизиты.Вставить("КурсДокумента",1);
	ОбязательныеРеквизиты.Вставить("ТипЦен",1);
	ОбязательныеРеквизиты.Вставить("ХозОперация",1);
	//ОбязательныеРеквизиты.Вставить("СрокПоставки",1);
	//ОбязательныеРеквизиты.Вставить("ВидОплаты",1);
	ОбязательныеРеквизиты.Вставить("Замены",           ОбязательныеТовары);
	ОбязательныеРеквизиты.Вставить("ТоварыЗаменители", ОбязательныеТовары);
	
	Возврат ОбязательныеРеквизиты;
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Проверяет корректность заполнения объекта.
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
//
// Параметры:
//  Ошибки       - строка, в случае некорректного заполнения содержит описанием возникших ошибок, 
//  ДопРеквизиты - структура, на вход может быть передана структура с дополнительными реквизитами для проверки,
//  Заполнение   - булево, флаг проверки, 
//  Уникальность - булево, флаг проверки.
//
// Возвращаемое значение:
//  Булево - Возвращает Истина если все заполнено корректно и Ложь иначе.
// 
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	// Здесь могут быть определены дополнительные к стандартным обязательным реквизитам условия проверки
	Результат = дкПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	
	Возврат Результат;
КонецФункции // ПроверитьКорректность()

// Проверяет корректность заполнения характеристики номенклатуры
//                                                                
// Параметры:
//  СтрокаТовары - строка табличной части документа - ссылка на строку.
//  Ошибки       - строка - содержит описание ошибки.
//
// Возвращаемое значение:
//  Булево 
//
Функция ПроверитьЗаполнениеХарактеристики(СтрокаТовары, Ошибки="") Экспорт
	
	УчетВедется = СтрокаТовары.Номенклатура.ТипНоменклатуры.ИспользованиеХарактеристик = 1 ИЛИ  СтрокаТовары.Номенклатура.ТипНоменклатуры.ИспользованиеХарактеристик = 2;
	РучноеСписаниеХарактеристик = СтрокаТовары.Номенклатура.ТипНоменклатуры.АвтоСписаниеХарактеристик = Перечисления.РежимыАвтоСписанияХарактеристик.РучноеСписание ИЛИ
																СтрокаТовары.Номенклатура.ТипНоменклатуры.АвтоСписаниеХарактеристик.Пустая();
	Если УчетВедется И РучноеСписаниеХарактеристик И обЗначениеНеЗаполнено(СтрокаТовары.ХарактеристикаНоменклатуры) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ПроверитьЗаполнениеХарактеристики()

// Функция проверяет, допустимо ли изменение объекта
//
// Параметры:
//  БлокироватьРеквизиты - структура, структура блокируемых на изменение реквизитов.
//
// Возвращаемое значение:
// Булево - Возвращает Истина, если изменения возможны, ложь иначе
//          Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов.
//
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
    // Здесь может быть прописано определение наличия ссылок, блокирующих изменение объекта
	Возврат Истина;
КонецФункции // ДоступностьИзменения()

// Возвращает список возможных хозяйственных операций документа
// Возвращаемое значение: 
//  СписокЗначений. 
//  Строка списка: Значение - имя предопределенного элемента; 
//				   Представление - красивое его представление
// 				   "Помеченная" строка - ХО по умолчанию.
Функция ПолучитьСписокХозОпераций() Экспорт
	
	СписокХозОпераций = Новый СписокЗначений;
	СписокХозОпераций.Добавить("ЗаменаВЗаказеПоставщику", "Замена в заказе поставщику", Истина);
	
	Возврат СписокХозОпераций;
	
КонецФункции // ПолучитьСписокХозОпераций()

#Если Клиент Тогда
	
//Выполняет пересчет значений в таблице товаров
//
// Параметры:
// Проверка	– Булево – Флаг закрытия интервалов.
//
// Возвращаемое значение:
// Булево – Результат закрытия.
//
Процедура ПересчетТаблицы(ФормаЦен, ТаблицаТоваров, ПараметрыИзменений = Неопределено) Экспорт
	
	ТребуетсяПересчет = Ложь;
	ИзменилиЦену      = Ложь;
	ИзменилиВалюту    = Ложь;
	
	Если ТипЗнч(ПараметрыИзменений) = Тип("Структура") Тогда
		
		Если ПараметрыИзменений.Свойство("ТребуетсяПересчет") Тогда
			ТребуетсяПересчет = ПараметрыИзменений.ТребуетсяПересчет;
		КонецЕсли;
		
		Если ПараметрыИзменений.Свойство("ИзменилиЦену") Тогда
			ИзменилиЦену = ПараметрыИзменений.ИзменилиЦену;
		КонецЕсли;
		
		Если ПараметрыИзменений.Свойство("ИзменилиВалюту") Тогда
			ИзменилиВалюту = ПараметрыИзменений.ИзменилиВалюту;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбнулятьСуммовыеПоказатели = Неопределено;
	Для Каждого СтрокаЗамены Из ТаблицаТоваров.Строки Цикл
		
		Для Каждого ТекСтрока Из СтрокаЗамены.Строки Цикл
			
			Если ТребуетсяПересчет Тогда
				// если изменились, тип цен, валюта или курс, то получим цену
				Если ИзменилиЦену Тогда
					Цена = обПолучитьЦену(ФормаЦен.НовыйТипЦен, ТекСтрока.Номенклатура,?(ЭтоНовый(), Дата, МоментВремени()),, ФормаЦен.НоваяВалюта, ФормаЦен.НовыйКурс, ТекСтрока.ХарактеристикаНоменклатуры, ТекСтрока.ЕдиницаИзмерения, ПодразделениеКомпании);
					Если Цена = 0 Тогда
						Если ОбнулятьСуммовыеПоказатели = Неопределено Тогда // Если вопрос еще не задавался, то зададим его.
							Ответ = Вопрос("В табличной части присутствуют товары с нулевой ценой для выбранного типа цен <" + ФормаЦен.НовыйТипЦен + ">.
							|Обнулить цены для данных позиций?", РежимДиалогаВопрос.ДаНет);
							Если Ответ = КодВозвратаДиалога.Нет Тогда
								ОбнулятьСуммовыеПоказатели = Ложь;
							Иначе
								ОбнулятьСуммовыеПоказатели = Истина;
							КонецЕсли;
						КонецЕсли;
						
						Если ОбнулятьСуммовыеПоказатели Тогда
							ТекСтрока.Цена = 0;
						ИначеЕсли ИзменилиВалюту Тогда
							// Если обнулять цену не нужно, и при этом изменилась валюта,
							//то выполним пересчет значения старой цены.
							ТекСтрока.Цена = обПересчет(ТекСтрока.Цена, ФормаЦен.СтараяВалюта, ФормаЦен.СтарыйКурс, ФормаЦен.НоваяВалюта, ФормаЦен.НовыйКурс);
						КонецЕсли;
					КонецЕсли;
				Иначе // Значит сменилась только валюта и необходимо выполнить пересчет.
					ТекСтрока.Цена = обПересчет(ТекСтрока.Цена, ФормаЦен.СтараяВалюта, ФормаЦен.СтарыйКурс, ФормаЦен.НоваяВалюта, ФормаЦен.НовыйКурс);
				КонецЕсли;
				
			КонецЕсли;
			
			ОбработкаРеквизита("Товары.Цена", ТекСтрока, ФормаЦен.ВладелецФормы);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли

// Обработка изменения реквизитов документа
// Параметры
//  Имя			– Строка – Имя реквизита документа с полным путем (например Товары.Номенклатура).
//  ЭтаФорма	– Форма	 – Ссылка на форму документа. Если значение неопределено,
//                         производится программная обработка реквизитов.
//  ТекСтрока	– СтрокаТабличнойЧасти – Ссылка на строку табличной части документа, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей документов.
//  ДопПараметры– Структура			– Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   – Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ ДОКУМЕНТА
	Если Имя = "ДокументОснование" Тогда
		Если ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			Контрагент = ДокументОснование.Контрагент;
		КонецЕсли;
	ИначеЕсли Имя = "Организация" Тогда
		
		дкОбработкаРеквизита(ЭтотОбъект, Имя, ТекСтрока, ЭтаФорма, ДопПараметры);
		
		ОсвобожденОтНДС = ПодразделениеКомпании.ОсвобожденОтНДС ИЛИ Организация.ОсвобожденОтНДС;
		// Организация может являются плательщиком НДС, а может и нет.. надо обработать таблицу
		// однако ее может не быть, либо в ней не отражается НДС
		// Помимо этого необходимо учесть особенность документа "Поступление товаров", 
		// т.к. в этом случае контрагент (поставщик) может не является платильщиком НДС.
		// (если контрагент - частное лицо, не смотрим на флаг, проставляем ставку БезНДС)
		Если ЭтаФорма = Неопределено Тогда
			Для Каждого СтрокаТоваров Из ТоварыЗаменители Цикл
				Если ОсвобожденОтНДС Тогда
					СтрокаТоваров.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
				Иначе
					СтрокаТоваров.СтавкаНДС = СтрокаТоваров.Номенклатура.СтавкаНДС;
				КонецЕсли;
				ОбработкаРеквизита("Товары.Цена", СтрокаТоваров, ЭтаФорма, ДопПараметры);
			КонецЦикла;
		Иначе
			//ТаблицаТоваров = Товары;
			Для Каждого СтрокаЗамен Из ЭтаФорма.Товары.Строки Цикл
				Для Каждого СтрокаТоваров Из СтрокаЗамен.Строки Цикл
					Если ОсвобожденОтНДС Тогда
						СтрокаТоваров.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
					Иначе
						СтрокаТоваров.СтавкаНДС = СтрокаТоваров.Номенклатура.СтавкаНДС;
					КонецЕсли;
					ОбработкаРеквизита("Товары.Цена", СтрокаТоваров, ЭтаФорма, ДопПараметры);
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли Имя = "ПодразделениеКомпании" Тогда
		
		Рез = Истина;
		
		дкОбработкаРеквизита(ЭтотОбъект, Имя, ТекСтрока, ЭтаФорма, ДопПараметры);
		
		#Если Клиент Тогда
			// Если произошло интерактивное изменение подразделения компании, то, возможно, необходимо пересчитать цены,
			Если НЕ ЭтаФорма = Неопределено Тогда
				// В табличной части "Товары" может не быть реквизита "Цена".
				// Зададим вопрос пользователю, хочет ли он пересчитать цены.
				Если Вопрос("Пересчитать цены в табличной части в соответствии с выбранным подразделением?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
					
					Попытка
						МоментЦены = ?(ЭтоНовый(), Дата, МоментВремени());
					Исключение
						МоментЦены = Неопределено;
					КонецПопытки;
					
					Для Каждого СтрокаЗамены Из ЭтаФорма.Товары.Строки Цикл
						Для Каждого ТекСтрока Из СтрокаЗамены.Строки Цикл
							// Определим, есть ли в ТЧ реквизиты "ХарактеристикаНоменклатуры" и "ЕдиницаИзмерения".
							ХарактеристикаНоменклатуры = ТекСтрока.ХарактеристикаНоменклатуры;
							ЕдиницаИзмерения = ТекСтрока.ЕдиницаИзмерения;
							ТекСтрока.Цена = обПолучитьЦену(ТипЦен, ТекСтрока.Номенклатура, МоментЦены,, ВалютаДокумента, КурсДокумента, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, ПодразделениеКомпании);
							Рез = ОбработкаРеквизита("Товары.Цена", ТекСтрока, ЭтаФорма, ДопПараметры) И Рез;
						КонецЦикла;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		#КонецЕсли
		
	ИначеЕсли Имя = "ТипЦен" Тогда
		
		ТребуетсяПересчет = Истина;
		Если ДопПараметры <> Неопределено Тогда
			Если НЕ ДопПараметры.Свойство("ТребуетсяПересчет", ТребуетсяПересчет) Тогда
				ТребуетсяПересчет = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ТребуетсяПересчет Тогда
			Возврат Истина;
		КонецЕсли;
		
		
		// пересчитываем
		Если ЭтаФорма = Неопределено Тогда
			Для Каждого ТекСтрока Из ТоварыЗаменители Цикл
				// Если изменились, тип цен, валюта или курс, то получим цену.
				Цена = обПолучитьЦену(ТипЦен, ТекСтрока.Номенклатура, Ссылка,,ВалютаДокумента, КурсДокумента, ТекСтрока.ХарактеристикаНоменклатуры, ТекСтрока.ЕдиницаИзмерения, ПодразделениеКомпании);
				Если Цена <> 0 Тогда
					ТекСтрока.Цена = Цена;
					ОбработкаРеквизита("Товары.Цена", ТекСтрока, ЭтаФорма, ДопПараметры);
				КонецЕсли;
			КонецЦикла;
		Иначе
			Для Каждого СтрокаЗамен Из ЭтаФорма.Товары.Строки Цикл
				Для Каждого ТекСтрока Из СтрокаЗамен.Строки Цикл
					// Если изменились, тип цен, валюта или курс, то получим цену.
					Цена = обПолучитьЦену(ТипЦен, ТекСтрока.Номенклатура, Ссылка,,ВалютаДокумента, КурсДокумента, ТекСтрока.ХарактеристикаНоменклатуры, ТекСтрока.ЕдиницаИзмерения, ПодразделениеКомпании);
					Если Цена <> 0 Тогда
						ТекСтрока.Цена = Цена;
						ОбработкаРеквизита("Товары.Цена", ТекСтрока, ЭтаФорма, ДопПараметры);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли Найти(Имя, "ТоварыЗаменители.") = 1 Тогда
		ОбработкаРеквизита(СтрЗаменить(Имя, "ТоварыЗаменители.", "Товары."), ТекСтрока, ЭтаФорма, ДопПараметры);
	ИначеЕсли Имя = "Товары.Номенклатура" ИЛИ Имя = "Товары.ХарактеристикаНоменклатуры" ИЛИ Имя = "Товары.ЕдиницаИзмерения" Тогда
		
		Если НЕ ТипЗнч(ДопПараметры) = Тип("Структура") Тогда
			ДопПараметры = Новый Структура;
		КонецЕсли;
		
		Если ТипЗнч(ТекСтрока) = Тип("СтрокаДереваЗначений") Тогда
			Если ТекСтрока.Родитель = Неопределено Тогда
				ДопПараметры.Вставить("ТабличнаяЧастьТовары", ЭтаФорма.Товары.Строки);
			Иначе
				ДопПараметры.Вставить("ТабличнаяЧастьТовары", ТекСтрока.Родитель.Строки);
			КонецЕсли;
		Иначе
			ИмяТЧ = Метаданные.НайтиПоТипу(ТипЗнч(ТекСтрока)).Имя;
			ДопПараметры.Вставить("ТабличнаяЧастьТовары", ЭтотОбъект[ИмяТЧ]);
		КонецЕсли;
		
		Рез = дкОбработкаРеквизита(ЭтотОбъект, Имя, ТекСтрока, ЭтаФорма, ДопПараметры);
		
		Если ТипЗнч(ТекСтрока) = Тип("СтрокаДереваЗначений") И ТекСтрока.Родитель = Неопределено Тогда
			ТекСтрока.Цена = 0;
			Рез = ОбработкаРеквизита("Товары.Цена", ТекСтрока, ЭтаФорма, ДопПараметры) И Рез;
		КонецЕсли;
		
		Возврат Рез;
		
	ИначеЕсли Имя = "Товары.СтавкаНДС" Тогда
		Если ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ЗаказВнутренний") И ЗначениеЗаполнено(ТекСтрока.СтавкаНДС) Тогда
			ТекСтрока.СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
		КонецЕсли;
		Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	Иначе
		Возврат дкОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
	
КонецФункции // ОбработкаРеквизита()

// заполнение свойств из документа основания
Процедура ЗаполнитьСвойстваНаОсновании(Основание) Экспорт
 //зарезервировано для описания заполнения свойств из свойств основания
КонецПроцедуры

#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПЕЧАТИ ДОКУМЕНТА

//Функция печати этикеток и ценников
// 
// Параметры:
//  ТабДокумент - табличный документ.
//
Функция ПечатьЭтикетокИЦенников(ТабДокумент) Экспорт
	дкПечатьЭтикетокИЦенников(ЭтотОбъект);
КонецФункции // ПечатьЭтикетокИЦенников()

// Формирует печатную форму "КорректировкаЗаказаПокупателя"
// 
// Параметры:
//  ТабДокумент - табличный документ.
//
// Возвращаемое значение:
//  ТабДокумент - возвращает сформированный табличный документ.
//
Функция ПечатьЗаменаВЗаказеПоставщику(ТабДокумент) Экспорт
	
	Макет = ПолучитьМакет("ЗаменаВЗаказеПоставщику");
	
	//для начала настроим макет
	ОбластьШапкаТаблицы = дкПривестиМакетПечатнойФормы(ЭтотОбъект, Макет);
	ФорматВыводаСуммы = обПраво("ФорматВыводаСуммы",Права,,ЭтотОбъект);
	
	ОбластьТовар = Макет.Область("Товар");
	
	//вывод заголовка документа
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Заполнить(ЭтотОбъект);
	ТекстЗаголовка = дкПолучитьПредставление(ЭтотОбъект);
	ОбластьМакета.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	СтруктураПредставления=Новый Структура(
		"ИНН,КПП,Наименование,АдресЮридический,ТелефонРабочий",
		"ИНН ","КПП ","","","тел.: "
	);
	
	ОбластьМакета.Параметры.ДокументОснованиеПредставление = дкПолучитьПредставление(ДокументОснование);
	Если обЗначениеНеЗаполнено(ДокументОснование) Тогда
		ОбластьМакета.Параметры.ДокументОснованиеПредставление	= "<заказ не выбран>"
	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ОбластьМакета.Параметры.Контрагент = ДокументОснование.Контрагент;
		ОбластьМакета.Параметры.КонтрагентПредставление	= спПолучитьПредставление(ДокументОснование.Контрагент,СтруктураПредставления);
	КонецЕсли;
	
	ДополнительныеПараметры = спСоздатьПараметрыПолученияПредставления();
	ДополнительныеПараметры.Вставить("ИспользоватьКПППодразделения");
	ДополнительныеПараметры.Вставить("ПодразделениеКомпании", ПодразделениеКомпании);
	ОбластьМакета.Параметры.ОрганизацияПредставление = спПолучитьПредставление(Организация, , ДополнительныеПараметры);
	
	//вывод свойств
	СтрокаСвойств = дкПолучитьСтрокуСвойствДокумента(ЭтотОбъект);
	ОбластьМакета.Параметры.СтрокаСвойств = СтрокаСвойств;
	ТабДокумент.Вывести(ОбластьМакета);
	
	НомерСтраницы = 2;
	НомерСтраницыПред = НомерСтраницы;
	
	//теперь выводим шапку
	ТабДокумент.Вывести(ОбластьШапкаТаблицы);
	
	//готовим области строки
	ОбластьМакета            = Макет.ПолучитьОбласть("Строка");
	ОбластьШапкаЗаменителей  = Макет.ПолучитьОбласть("ШапкаЗаменителей");
	ОбластьСтрокаЗаменителей = Макет.ПолучитьОбласть("СтрокаЗаменителей");
	ОбластьПодвал            = Макет.ПолучитьОбласть("Подвал");
	
	ОбластьМакетаИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
	СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента, СуммаНДС, СуммаВсего", ВалютаДокумента,0,0);
	
	//заполним параметры шапки таблицы для следующего листа
	ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
	ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
	
	//перебор строк
	ВыборкаТабличнойЧасти = Замены;
	Для Каждого СтрокаТабличнойЧасти Из ВыборкаТабличнойЧасти Цикл
		//заполняем данные строки
		СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаТабличнойЧасти, ЭтотОбъект);
		ОбластьМакета.Параметры.Заполнить(СтруктураСтроки);
		
		МассивЗаменителей = ТоварыЗаменители.НайтиСтроки(Новый Структура("ИдентификаторСтроки", СтрокаТабличнойЧасти.ИдентификаторСтроки));
		
		мсвДопОбластиПодвала = Неопределено;
		Если МассивЗаменителей.Количество() > 0 Тогда
			ТабДокВрем = Новый ТабличныйДокумент;
			ТабДокВрем.ПолеСверху = 0;
			ТабДокВрем.ПолеСнизу  = 0;
			ТабДокВрем.ПолеСлева  = 0;
			ТабДокВрем.ПолеСправа = 0;
			ТабДокВрем.Вывести(ОбластьШапкаЗаменителей);
			Для Каждого СтрокаЗаменителей Из МассивЗаменителей Цикл
				СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаЗаменителей, ЭтотОбъект);
				ОбластьСтрокаЗаменителей.Параметры.Заполнить(СтруктураСтроки);
				ТабДокВрем.Вывести(ОбластьСтрокаЗаменителей);
			КонецЦикла;
			мсвДопОбластиПодвала = Новый Массив;
			мсвДопОбластиПодвала.Добавить(ТабДокВрем);
		КонецЕсли;
		
		//доп. области
		Если ВыборкаТабличнойЧасти.Индекс(СтрокаТабличнойЧасти) = ВыборкаТабличнойЧасти.Количество()-1 Тогда
			Если мсвДопОбластиПодвала = Неопределено Тогда
				мсвДопОбластиПодвала = Новый Массив;
			КонецЕсли;
			мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
		КонецЕсли;
		
		//выводим строку, делая проверку попадания на лист
		НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьМакета, ОбластьШапкаТаблицы, ОбластьМакетаИтогоПоСтранице,
			НомерСтраницы, СтруктураИтоговПоСтранице, ЭтотОбъект, мсвДопОбластиПодвала);
			
		//инициализация итогов по странице
		Если НомерСтраницы <> НомерСтраницыПред Тогда
			СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента, СуммаНДС, СуммаВсего", ВалютаДокумента,0,0);
			НомерСтраницыПред = НомерСтраницы;
			ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
		КонецЕсли;
		
		Если МассивЗаменителей.Количество()> 0 Тогда
			ТабДокумент.Вывести(ОбластьШапкаЗаменителей);
			Для Каждого СтрокаЗаменителей Из МассивЗаменителей Цикл
				//заполняем данные строки
				СтруктураСтроки = дкПолучитьПредставлениеДанныхТоварнойСтроки(СтрокаЗаменителей, ЭтотОбъект);
				ОбластьСтрокаЗаменителей.Параметры.Заполнить(СтруктураСтроки);
				ТабДокумент.Вывести(ОбластьСтрокаЗаменителей);
				//добавляем итоги
				дкДобавитьИтогиПоСтранице(СтрокаЗаменителей, СтруктураИтоговПоСтранице);
			КонецЦикла;
		КонецЕсли;
		
	КонецЦикла;

	//выводим последний подвал, если страниц больше единицы
	Если НомерСтраницы > 2 Тогда
		дкВывестиИтогиПоСтранице(ТабДокумент, ОбластьМакетаИтогоПоСтранице, СтруктураИтоговПоСтранице, ЭтотОбъект);
	КонецЕсли;
	
	//итоги
	ОбластьПодвал.Параметры.ВалютаДокумента = ВалютаДокумента;
	СуммаВсего = ТоварыЗаменители.Итог("СуммаВсего");
	ОбластьПодвал.Параметры.СуммаВсего = Формат(СуммаВсего,ФорматВыводаСуммы);
	НДСВсего = ТоварыЗаменители.Итог("СуммаНДС");
	ОбластьПодвал.Параметры.НДСВсего = Формат(НДСВсего,ФорматВыводаСуммы);
	
	ОбластьПодвал.Параметры.СуммаПрописью = "Всего наименований "+ТоварыЗаменители.Количество()+" на сумму " + обЧислоПрописью(СуммаВсего, ВалютаДокумента);
	
	// Выводим представления и расшифровки подписей
	Исполнитель = дкОтветственноеЛицо(ЭтотОбъект,"ИсполнительКонтрагент");
	Исполнитель.ИсполнительКонтрагентПредставление = ?(обЗначениеНеЗаполнено(Исполнитель.ИсполнительКонтрагент),"","/ "+ Исполнитель.ИсполнительКонтрагентПредставление);
	ОбластьПодвал.Параметры.Заполнить(Исполнитель);
	Заказчик  = дкОтветственноеЛицо(ЭтотОбъект,"ЗаказчикОрганизация");
	Заказчик.ЗаказчикОрганизацияПредставление = ?(обЗначениеНеЗаполнено(Заказчик.ЗаказчикОрганизация),"","/ "+ Заказчик.ЗаказчикОрганизацияПредставление);
	ОбластьПодвал.Параметры.Заполнить(Заказчик);
	
	НомерСтраницы = дкВывестиГоризонтальнуюОбласть(ТабДокумент, ОбластьПодвал, , , НомерСтраницы,,ЭтотОбъект);
	
	Возврат ТабДокумент;
КонецФункции // ПечатьЗаменаВЗаказеПоставщику()

// Функция осуществляет печать произвольного документа.
// Можно направить печать на экран или принтер, а также распечатать необходимое количество копий.
//
// Параметры:
//	ЭтотОбъект							- ДокументОбъект	- Документ для печати
//	НазваниеПечатнойФормы 				- Строка			- Название печатной формы, если пусто, то по умолчанию
//	КоличествоЭкземпляров				- Число				- Количество экземпляров документа
//	НаПринтер							- Булево			- Признак отправки документа на принтер без отображения его на экране
//  Документ 	  						- ТабличныйДокумент	- Макет печатной формы
//
// Возвращаемое значение:
//   ТабличныйДокумент	- Сформированная печатная форма
//
Функция Печать(НазваниеПечатнойФормы="", КоличествоЭкземпляров=0, НаПринтер=Ложь, Документ=Неопределено) Экспорт
	Возврат дкПечать(ЭтотОбъект, НазваниеПечатнойФормы, КоличествоЭкземпляров, НаПринтер, Документ);
КонецФункции // Печать()

#КонецЕсли
// Если Клиент Тогда - завершена клиентская часть


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если НЕ дкПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриУстановкеНовогоНомера()

// Процедура обработчик ввода на основании
Процедура ОбработкаЗаполнения(Основание)
	
	Если НЕ дкОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	
	Если НЕ обЗначениеНеЗаполнено(Основание) Тогда
		Если ТипЗнч(Основание)=Тип("ДокументСсылка.ЗаказПоставщику") Тогда
			Контрагент = Основание.Контрагент;
		КонецЕсли;
		Запрос=Новый Запрос;
		Запрос.Текст="ВЫБРАТЬ
		             |	ЗаказыПоставщикамОстатки.Номенклатура КАК Номенклатура,
		             |	ЕСТЬNULL(ЗаказыПоставщикамОстатки.ЗаказаноОстаток,0) КАК Количество,
		             |	ЗаказыПоставщикамОстатки.ЗаказПоставщику КАК ЗаказПоставщика,
		             |	ЗаказыПоставщикамОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
		             |ИЗ
		             |	РегистрНакопления.ЗаказыПоставщикам.Остатки(&НаМомент, ЗаказПоставщику = &Заказ) КАК ЗаказыПоставщикамОстатки
		             |ГДЕ
		             |	ЕСТЬNULL(ЗаказыПоставщикамОстатки.ЗаказаноОстаток, 0) > 0
		             |";
		Запрос.УстановитьПараметр("НаМомент", ТекущаяДата());
		Запрос.УстановитьПараметр("Заказ",    Основание);
		Замены.Загрузить(Запрос.Выполнить().Выгрузить());
		Для Каждого СтрокаТоваров Из Замены Цикл
			ОбработкаРеквизита("Товары.Номенклатура", СтрокаТоваров);
			СтрокаТоваров.ИдентификаторСтроки = Новый УникальныйИдентификатор;
			Если (НЕ СтрокаТоваров.Коэффициент = 0) И (НЕ СтрокаТоваров.Коэффициент = 1) Тогда
				СтрокаТоваров.Количество = Окр(СтрокаТоваров.Количество/СтрокаТоваров.Коэффициент, 3);
				ОбработкаРеквизита("Товары.Количество", СтрокаТоваров);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ дкПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриКопировании()

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ДополнительныеСвойства.Вставить("ЗаказБыл");
	ДополнительныеСвойства.Вставить("МоментВремениБыл");
	
	Если НЕ дкПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда Возврат; КонецЕсли;
	
	// получим старые значения, влияющие на границы последовательности
	Если НЕ Отказ И Проведен И РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
		БылиДвижения = Ложь;
		Запрос = Новый Запрос();
		Запрос.УстановитьПараметр("Ссылка",Ссылка);
		
		// Заказы
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Заказы.Заказ КАК Заказ
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗаказыПокупателей.Заказ КАК Заказ
		|	ИЗ
		|		РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
		|	ГДЕ
		|		ЗаказыПокупателей.Регистратор = &Ссылка
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		ЗаказыПоставщикам.ЗаказПоставщику
		|	ИЗ
		|		РегистрНакопления.ЗаказыПоставщикам КАК ЗаказыПоставщикам
		|	ГДЕ
		|		ЗаказыПоставщикам.Регистратор = &Ссылка
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		ЗаказыРаспределение.ЗаказПокупателя
		|	ИЗ
		|		РегистрНакопления.ЗаказыРаспределение КАК ЗаказыРаспределение
		|	ГДЕ
		|		ЗаказыРаспределение.Регистратор = &Ссылка
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		ЗаказыРаспределение.ЗаказПоставщика
		|	ИЗ
		|		РегистрНакопления.ЗаказыРаспределение КАК ЗаказыРаспределение
		|	ГДЕ
		|		ЗаказыРаспределение.Регистратор = &Ссылка) КАК Заказы";
		Результат = Запрос.Выполнить();
		Если НЕ Результат.Пустой() Тогда
			БылиДвижения = Истина;
			ДополнительныеСвойства.Вставить("ЗаказБыл", Результат.Выгрузить().ВыгрузитьКолонку("Заказ"));
		КонецЕсли;
		
		// прошлый момент времени
		Если БылиДвижения Тогда
			Запрос.Текст = "ВЫБРАТЬ МоментВремени ИЗ Документ."+Метаданные().Имя+" ГДЕ Ссылка=&Ссылка";
			ДополнительныеСвойства.Вставить("МоментВремениБыл",Запрос.Выполнить().Выгрузить().Получить(0).МоментВремени);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ)
	Если НЕ дкПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПриЗаписи()

Процедура ПередУдалением(Отказ)
	Если НЕ дкПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ПередУдалением()

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если НЕ дкОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры // ОбработкаУдаленияПроведения()

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Если НЕ дкОбработкаПроведения(ЭтотОбъект, Отказ, Режим) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	ДокументТовары.Ссылка.ДокументОснование КАК ЗаказПоставщику,
	|	ДокументТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ДокументТовары.Номенклатура КАК Номенклатура,
	|	ДокументТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ДокументТовары.Количество*ДокументТовары.Коэффициент КАК Количество
	|ИЗ
	|	Документ.ЗаменаВЗаказеПоставщику.Замены КАК ДокументТовары
	|ГДЕ
	|	ДокументТовары.Ссылка = &Ссылка И 
	|	ДокументТовары.Количество > 0
	|");
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	
	РезультатЗапросаПоТоварам = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписейЗаказыПоставщикам = Движения.ЗаказыПоставщикам;
	НаборЗаписейЗаказыПоставщикам.РежимПроведения           = Режим;
	НаборЗаписейЗаказыПоставщикам.ДокументОбъект            = ЭтотОбъект;
	НаборЗаписейЗаказыПоставщикам.РезультатЗапросаПоТоварам = РезультатЗапросаПоТоварам;
	НаборЗаписейЗаказыПоставщикам.ЗаказПоставщику           = Неопределено;
	Отказ = НЕ НаборЗаписейЗаказыПоставщикам.КорректировкаСписаниемЗаказаПоставщика() ИЛИ Отказ;
	
	//Снимаем распределение заказов покупателя
	РезультатЗакрытияЗаказов = НаборЗаписейЗаказыПоставщикам.Выгрузить();
	РезультатЗакрытияЗаказов.Свернуть("Номенклатура, ХарактеристикаНоменклатуры", "Заказано");
	
	КолонкаКоличества = РезультатЗакрытияЗаказов.Колонки.Найти("Заказано");
	КолонкаКоличества.Имя = "Количество";
	
	// Снимаем резервы по заказам (если таковые были)
	//НаборЗаписейЗаказыПокупателей = Движения.ЗаказыПокупателей;
	//НаборЗаписейЗаказыПокупателей.РежимПроведения = Режим;
	//НаборЗаписейЗаказыПокупателей.ДокументОбъект  = ЭтотОбъект;
	//НаборЗаписейЗаказыПокупателей.РезультатЗапросаПоТоварам = РезультатЗапросаПоТоварам;
	//НаборЗаписейЗаказыПокупателей.Заказ           = ДокументОснование;
	//НаборЗаписейЗаказыПокупателей.ВидОперации     = Перечисления.ВидыОперацийЗаказов.Замена;
	//НаборЗаписейЗаказыПокупателей.СкладКомпании   = Неопределено;
	//Отказ = НЕ НаборЗаписейЗаказыПокупателей.КорректировкаСписаниемЗаказаПокупателя() ИЛИ Отказ;
	//
	////Снимаем распределение заказов покупателя
	//РезультатЗакрытияЗаказов = НаборЗаписейЗаказыПокупателей.Выгрузить();
	//РезультатЗакрытияЗаказов.Свернуть("Номенклатура, ХарактеристикаНоменклатуры", "Заказано");
	//
	//КолонкаКоличества = РезультатЗакрытияЗаказов.Колонки.Найти("Заказано");
	//КолонкаКоличества.Имя = "Количество";
	
	//НаборЗаписейРаспределениеЗаказов = Движения.ЗаказыРаспределение;
	//НаборЗаписейРаспределениеЗаказов.РежимПроведения = Режим;
	//НаборЗаписейРаспределениеЗаказов.ДокументОбъект = ЭтотОбъект;
	//НаборЗаписейРаспределениеЗаказов.РезультатЗапросаПоТоварам = РезультатЗакрытияЗаказов;
	//НаборЗаписейРаспределениеЗаказов.ЗаказПокупателя = ДокументОснование;
	//НаборЗаписейРаспределениеЗаказов.ЗаказПоставщика = Неопределено;
	//Отказ = НЕ НаборЗаписейРаспределениеЗаказов.КорректировкаРаспределения() ИЛИ Отказ;
	
	//Если ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ЗаказВнутренний") Тогда
	//	//Корректировка распределения других заказов, на внутреннем заказе
	НаборЗаписейРаспределениеЗаказов = Движения.ЗаказыРаспределение;
	НаборЗаписейРаспределениеЗаказов.РежимПроведения           = Режим;
	НаборЗаписейРаспределениеЗаказов.ДокументОбъект            = ЭтотОбъект;
	НаборЗаписейРаспределениеЗаказов.РезультатЗапросаПоТоварам = РезультатЗакрытияЗаказов;
	НаборЗаписейРаспределениеЗаказов.ЗаказПокупателя           = Неопределено;
	НаборЗаписейРаспределениеЗаказов.ЗаказПоставщика           = ДокументОснование;
	НаборЗаписейРаспределениеЗаказов.ПорядокЗакрытияЗаказовПоставщику = "ЗаказыРаспределениеОстатки.ЗаказПокупателя.Дата ВОЗР";
	Отказ=НЕ НаборЗаписейРаспределениеЗаказов.КорректировкаРаспределенияЗаказаПоставщику() ИЛИ Отказ;
	//КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	|	ЗаменаВЗаказеПоставщикуТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ЗаменаВЗаказеПоставщикуТовары.Номенклатура КАК Номенклатура,
	|	ЗаменаВЗаказеПоставщикуТовары.Количество * ЗаменаВЗаказеПоставщикуТовары.Коэффициент КАК Количество,
	|	ЗаменаВЗаказеПоставщикуТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ЗаменаВЗаказеПоставщикуТовары.СуммаВсего КАК СуммаВсего
	|ИЗ
	|	Документ.ЗаменаВЗаказеПоставщику.ТоварыЗаменители КАК ЗаменаВЗаказеПоставщикуТовары
	|ГДЕ
	|	ЗаменаВЗаказеПоставщикуТовары.Ссылка = &Ссылка И 
	|	ЗаменаВЗаказеПоставщикуТовары.Количество > 0";
	
	// Проводим заказ поставщику
	НаборЗаписейЗаказыПоставщикам = Движения.ЗаказыПоставщикам;
	НаборЗаписейЗаказыПоставщикам.РежимПроведения           = Режим;
	НаборЗаписейЗаказыПоставщикам.ДокументОбъект            = ЭтотОбъект;
	НаборЗаписейЗаказыПоставщикам.РезультатЗапросаПоТоварам = Запрос.Выполнить();
	НаборЗаписейЗаказыПоставщикам.ЗаказПоставщику           = ДокументОснование;
	НаборЗаписейЗаказыПоставщикам.Контрагент                = ДокументОснование.Контрагент;
	Отказ = НЕ НаборЗаписейЗаказыПоставщикам.Приход() ИЛИ Отказ;
	
	// двигаем границу последовательности заказов
	Если Режим<>РежимПроведенияДокумента.Оперативный ИЛИ ЗначениеЗаполнено(ДополнительныеСвойства.ЗаказБыл) Тогда
		НаборЗаписейГраницыЗаказы = РегистрыСведений.ГраницыЗаказы.СоздатьНаборЗаписей();
		Если Режим<>РежимПроведенияДокумента.Оперативный Тогда
			ТаблицаЗаказов = Движения.ЗаказыПоставщикам.Выгрузить();
			ТаблицаЗаказов.Колонки.Удалить("ЗаказПоставщику");
			ТаблицаЗаказов.Колонки.Добавить("Заказ",Новый ОписаниеТипов("ДокументСсылка.ЗаказПокупателя,ДокументСсылка.ЗаказВнутренний,ДокументСсылка.ЗаказПоставщику"));
			ТаблицаЗаказов.ЗагрузитьКолонку(Движения.ЗаказыПоставщикам.ВыгрузитьКолонку("ЗаказПоставщику"),"Заказ");
			Для каждого СтрокаЗаказа Из Движения.ЗаказыРаспределение Цикл
				НоваяСтрока=ТаблицаЗаказов.Добавить();
				НоваяСтрока.Заказ=СтрокаЗаказа.ЗаказПокупателя;
				НоваяСтрока=ТаблицаЗаказов.Добавить();
				НоваяСтрока.Заказ=СтрокаЗаказа.ЗаказПоставщика;
			КонецЦикла; 
			ТаблицаЗаказов.Свернуть("Заказ","");
			НаборЗаписейГраницыЗаказы.Заказ = ТаблицаЗаказов.ВыгрузитьКолонку("Заказ");
			НаборЗаписейГраницыЗаказы.МоментВремени = Дата;
			НаборЗаписейГраницыЗаказы.ЗаказБыл = ДополнительныеСвойства.ЗаказБыл;
			НаборЗаписейГраницыЗаказы.МоментВремениБыл = ДополнительныеСвойства.МоментВремениБыл;
		Иначе
			НаборЗаписейГраницыЗаказы.Заказ = ДополнительныеСвойства.ЗаказБыл;
			НаборЗаписейГраницыЗаказы.МоментВремени = ДополнительныеСвойства.МоментВремениБыл;
			НаборЗаписейГраницыЗаказы.ЗаказБыл = Неопределено;
			НаборЗаписейГраницыЗаказы.МоментВремениБыл = Неопределено;
		КонецЕсли;
		НаборЗаписейГраницыЗаказы.ДокументСсылка = Ссылка;
		НаборЗаписейГраницыЗаказы.ИзменитьГраницу();
	КонецЕсли;
	
	// выведем сообщения об ошибках и предупреждениях
	дкВыводРезультатовОбработки(ЭтотОбъект,Отказ);
	
КонецПроцедуры // ОбработкаПроведения()

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли
